import './footer.scss';
import { useState } from 'react';

// const withDigikala = ["اتاق خبر دیجی‌کالا", "فروش در دیجی‌کالا", "فرصت های شغلی", "گزارش تخلف در دیجی‌کالا", "تماس با دیجی‌کالا", "درباره دیجی‌کالا"]
// const customerService = ["پاسخ به پرسش‌های متداول, "رویه‌های بازگرداندن کالا", "شرایط استفاده", "حریم خصوصی", "گزارش باگ"]
// const shoppingGuide = ["نحوه ثبت سفارش", "رویه ارسال سفارش", "شیوه‌های پرداخت"]


const Footer = () => {
    const [isExpanded, setIsExpanded] = useState(false);

    const handleToggle = () => {
        setIsExpanded(prev => !prev);
    };

    return (
        <footer>
            <div className="first-layer">
                <button className='first-layer-left'>باز گشت به بالا</button>
                <img src='../../../public/logo/full-horizontal.svg' alt='logo'></img>
            </div>
            <div className="second-layer">
                <p>تلفن پشتیبانی ۶۱۹۳۰۰۰۰ - ۰۲۱</p>
                <div>|</div>
                <p>۰۲۱-۹۱۰۰۰۱۰۰</p>
                <div>|</div>
                <p>ر۷ روز هفته، ۲۴ ساعته پاسخگوی شما هستیم</p>
            </div>
            <div className="third-layer">
                <a>
                    <div>
                        <img src='../../../public/original-products.svg' alt='ضمانت اصل بودن کالا'></img>
                    </div>
                    <p>ضمانت اصل بودن کالا</p>
                </a>
                <a>
                    <div>
                        <img src='../../../public/days-return.svg' alt='۷ روز ضمانت بازگشت کالا'></img>
                    </div>
                    <p>۷ روز ضمانت بازکشت کالا</p>
                </a>
                <a>
                    <div>
                        <img src='../../../public/support.svg' alt='۷ روز هفته،۲۴ ساعته'></img>
                    </div>
                    <p>۷ روز هفته، ۲۴ ساعت</p>
                </a>
                <a>
                    <div>
                        <img src='../../../public/cash-on-delivery.svg' alt='امکان پرداخت در محل'></img>
                    </div>
                    <p>امکان پرداخت در محل</p>
                </a>
                <a>
                    <div>
                        <img src='../../../public/express-delivery.svg' alt='امکان تحویل اکسپرس'></img>
                    </div>
                    <p>امکان تحویل اکسپرس</p>
                </a>
            </div>
            <div className="fourth-layer">
                <div className="fourth-sec-one">
                    <p>با دیجیکالا</p>
                    <a href='#'>اتاق خبر دیجی‌کالا</a>
                    <a href='#'>فروش در دیجی‌کالا</a>
                    <a href='#'>فرصت های شغلی</a>
                    <a href='#'>گزارش تخلف در دیجی‌کالا</a>
                    <a href='#'>تماس با دیجی‌کالا</a>
                    <a href='#'>درباره دیجی‌کالا</a>
                </div>
                <div className="fourth-sec-two">
                    <p>خدمات مشتریان</p>
                    <a href='#'>پاسخ به پرسش‌های متداول</a>
                    <a href='#'>رویه‌های بازگرداندن کالا</a>
                    <a href='#'>شرایط استفاده</a>
                    <a href='#'>حریم خصوصی</a>
                    <a href='#'>گزارش باگ</a>
                </div>
                <div className="fourth-sec-three">
                    <p>راهنمای خرید از دیجی‌کالا</p>
                    <a href='#'>نحوه ثبت سفارش</a>
                    <a href='#'>رویه ارسال سفارش</a>
                    <a href='#'>شیوه‌های پرداخت</a>
                </div>
                {/* <div>
                    <h1>با دیجی‌کالا</h1>
                    <ul className='ListGroup'>
                        {withDigikala.map(withDigikala => <li>{withDigikala}</li>)}
                    </ul>
                </div> */}
                {/* <div>
                    <h1>خدمات مشتریان/h1>
                    <ul className='ListGroup'>
                        {customerService.map(customerService => <li>{customerService}</li>)}
                    </ul>
                </div> */}
                {/* <div>
                    <h1>راهنمای خرید دیجی‌کالا</h1>
                    <ul className='ListGroup'>
                        {shoppingGuide.map(shoppingGuide => <li>{shoppingGuide}</li>)}
                    </ul>
                </div> */}
                <div className="fourth-sec-four">
                    <div className="fourth-sec-four-upper">
                        <h4>همراه ما باشید!</h4>
                        <div className="socialMedia">
                            <img src='../../../public/logo/instagram.webp' alt='instagram'></img>
                            <img src='../../../public/logo/x.jpg' alt='x'></img>
                            <img src='../../../public/logo/linkdin.png' alt='linkdin'></img>
                            <img src='../../../public/logo/aparat.png' alt='aparat'></img>
                        </div>
                    </div>
                    <div className="fourth-sec-four-down">
                        <h4>با ثبت ایمیل، از جدیدترین تخفیف‌ها باخبر شوید</h4>
                        <form className="email-form">
                            <input 
                                type="email" 
                                placeholder="آدرس ایمیل خود را وارد کنید"
                                required
                            />
                            <button type="submit">ثبت</button>
                        </form>
                    </div>
                </div>
            </div>
            <div className="fifth-layer">
                <div className="fifth-right-sec">
                    <img src='../../../public/logo/footerlogo2.webp' alt='footerlogo'></img>
                    <h3>دانلود اپلیکیشن دیجی‌کالا</h3>
                </div>
                <div className="fifth-left-sec">
                    <img src='../../../public/logo/coffe-bazzar.svg' alt='coffe bazzar'></img>
                    <img src='../../../public/logo/myket.svg' alt='myket'></img>
                    <img src='../../../public/logo/sib-app.svg' alt='sib app'></img>
                    <img src='../../../public/logo/more.svg' alt='more' className='more'></img>
                </div>
            </div>
            <div className="sixth-layer">
                <div className="sixth-content">
                    <div className={`text-container ${isExpanded ? 'expanded' : ''}`}>
                        <h2>فروشگاه اینترنتی دیجی‌کالا</h2>
                        <p className="fade-text">
                            یک خرید اینترنتی مطمئن، نیازمند فروشگاهی است که بتواند کالاهایی متنوع، باکیفیت و دارای قیمت مناسب را در مدت زمانی کوتاه به دست مشتریان خود برساند و ضمانت بازگشت کالا هم داشته باشد؛ ویژگی‌هایی که فروشگاه اینترنتی دیجی‌کالا سال‌هاست بر روی آن‌ها کار کرده و توانسته از این طریق مشتریان ثابت خود را داشته باشد.
                            یکی از مهم‌ترین دغدغه‌های کاربران دیجی‌کالا یا هر فروشگاه‌ اینترنتی دیگری، این است که کالای خریداری شده چه زمانی به دستشان می‌رسد. دیجی‌کالا شیوه‌های مختلفی از ارسال را متناسب با فروشنده کالا،‌ مقصد کالا و همچنین نوع کالا در اختیار کاربران خود قرار می‌دهد. هر یک از روش های ارسال دیجی کالا شرایط و ویژگی‌های خاص خود را دارند که ممکن است گاهی برای کاربران جدید، مبهم و پیچیده به نظر برسند. برای آگاهی بیشتر مشتریان از خدمات دیجی‌کالا، این فروشگاه اینترنتی در بخشی از وب‌سایت خود راهنمای کاملی از شیوه‌‌های ارسال را به صورت ساده و به دور از پیچیدگی، قرار داده است که شامل 8 نوع ارسال کالا به روش‌های زیر است: ارسال امروز، دریافت حضوری، دریافت از گنجه، ارسال توسط فروشنده، ارسال عادی، ارسال کالاهای بزرگ، سنگین و فوق سنگین، ارسال سریع سوپرمارکتی، ارسال با پست
                            کدام محصولات در دیجی‌کالا قابل سفارش هستند؟
                            تقریبا می‌توان گفت محصولی وجود ندارد که دیجی‌کالا برای مشتریان خود در سراسر کشور فراهم نکرده باشد. شما می‌توانید در تمامی روزهای هفته و تمامی شبانه روز دیجی‌کالا که محصولات دارای تخفیف عالی می‌شوند، سفارش خود را به سادگی ثبت کرده و در روز و محدوده زمانی مناسب خود، درب منزل تحویل بگیرید. بعضی از گروه‌های اصلی و زیر مجموعه‌های پرطرفدار محصولات دیجی‌کالا شامل مواردی می‌شود که در ادامه به معرفی آن‌ها می‌پردازیم که امکان ارسال امروز برای آن ها وجود دارد. 
                            دیجی کالا در جشنواره‌های سالیانه خود به طور معمول روی تمام دسته بندی‌های کالایی تخفیف‌های عالی قرار‌می‌دهد. به عنوان مثال در زمان بلک فرایدی یا حراج جمعه سیاه، در این سال‌ها بیشترین درصد تخفیف در اختیار مشتریان دیجی‌کالا قرار گرفته‌است و شامل دسته بندی های مختلف از موبایل و لپ تاپ تا عطر و لباس و حتی غذای حیوانات خانگی بوده‌است. 
                            کالای دیجیتال
                            انواع گوشی موبایل از برندهای مختلفی مثل آیفون،  گوشی سامسونگ، گوشی نوکیا، گوشی شیائومی، گوشی هواوی، و...، انواع کنسول بازی ps4 و ps5، انواع تبلت‌های پرطرفدار مثل تبلت سامسونگ نوت 10، انواع هندزفری مثل هندزفری بی سیم، تلوزیون از برندهای مختلف مثل تلویزیون سامسونگ، سونی و...، انواع مانیتور، کیس، کیبورد، مودم از برندهای مختلف مثل مودم ایرانسل، آنتن و ... تنها بخشی از محصولاتی هستند که زیر مجموعه کالای دیجیتال در دیجی‌کالا قرار دارند.
                            خودرو، ابزار و تجهیزات صنعتی
                            انواع خودروهای ایرانی و خارجی از برندهای مطرحی مثل هوندا، کیا و...، موتور سیکلت از برندهایی مثل کویر موتور و...، لوازم جانبی خودرو مثل سیستم صوتی تصویر، ضبط و...، لوازم یدکی مثل دیسک و صفحه کلاج و... و لوازم مصرفی خودرو مثل کفپوش سانا در این گروه قرار می‌گیرند.
                            مد و پوشاک
                            محصولاتی مثل انواع لباس مثل لباس مجلسی زنانه و مردانه، لباس راحتی، لباس ورزشی، اکسسوری، کیف، کفش، عینک آفتابی، لباس زیر، شال و روسری و... جزو مواردی هستند که می‌توانید آن‌ها را از برندهای مطرح ایرانی و خارجی موجود در دیجی کالا مثل آدیداس، نایکی، دبنهامز، آلدو، درسا و... خریداری کنید.
                            اسباب بازی کودک و نوزاد
                            در این دسته از کالاهای دیجی‌کالا، انواع لوازم بهداشتی و حمام کودک و نوزاد، انواع پوشاک و کفش، تبلت، اسباب‌بازی، لوازم اتاق خواب کودک، لوازم ایمنی، لوازم شخصی و غذا خوری و ... قرار می‌گیرد تا خرید را برای پدر و مادرها به کاری سریع و آسان تبدیل کند.
                            کالاهای سوپر مارکتی
                            هر چیزی از مواد خوراکی که به آن نیاز دارید، در سوپرمارکت دیجی‌کالا پیدا می‌شود، محصولات پرطرفداری مثل کره بادام‌زمینی، عسل، سس، قهوه، زعفران، شکلات، انواع نان و ... از برندهای معتبر و معروفی مثل نستله، نوتلا، استارباکس، مزمز، چی توز و ... همگی در اختیار شما هستند و تا رسیدن به آشپزخانه شما تنها چند کلیک فاصله دارند.
                            زیبایی و سلامت
                            انواع لوازم آرایش مثل لاک، رنگ مو، لوازم آرایش لب، چشم، صورت و... همگی در دیجی‌کالا موجود هستند. همچنین محصولات بهداشتی مثل انواع شامپو، کرم ضد آفتاب، ماسک صورت، ضد تعریق، ماسک مو  و...، انواع لوازم شخصی برقی، ست هدیه، بهترین انواع عطر و اسپری، کرم پودر، ریمل و رژلب وانواع زیورآلات طلا و نقره مثل سرویس طلا، سرویس نقره و... به همراه وسایل مراقبت شخصی طبی در گروه زیبایی و سلامت دیجی‌کالا قرار می‌گیرد. در این بخش برندهای مطرحی مثل اسنس، پنبه ریز، سینره و... حضور دارند.همچنین میتوانید انواع مکمل غذایی و دارویی مثل داروی مناسب سرماخوردگی را در دیجی کالا تهیه کنید.
                            خانه و آشپزخانه
                            یکی از متنوع‌ترین بخش‌های دیجی‌کالا، بخش لوازم خانه و آشپزخانه است که از محصولاتی مثل صندلی گیمینگ در بخش صندلی‌ها گرفته تا انواع مبل راحتی، انواع آبگرمکن مثل آبگرمکن بوتان، لباسشویی‌های متنوع مثل انواع لباسشویی اسنوا، شیرآلات مختلف مثل شیرآلات قهرمان و...، ظروف و همچنین لوازم برقی آشپزخانه مثل توستر و... را شامل می‌شود و امکان خریدی عالی را برای مشتریان فراهم کرده است. در بخش لوازم خانگی دیجی‌کالا، برندهای معتبری مثل تفال، اخوان، فیلیپس، ال جی، اسنوا، جی پلاس و... حضور دارند.
                            کتاب، لوازم تحریر و هنر
                            بخش هنر، کتاب، رمان و لوازم تحریر دیجی‌کالا نیز یکی از متنوع‌ترین بخش‌های این فروشگاه اینترنتی است. انواع کتاب و مجله، کتاب زبان، بازی، لوازم تحریر با طرح‌های مختلف مانند دختر کفشدوزکی، سازهایی مثل پیانو، سنتور، هنگ درام  و... با بهترین قیمت‌ها و از بهترین برندها در دسترس شما قرار دارند.
                            ورزش و سفر
                            هر نوع وسیله و لباس ورزشی که فکرش را کنید، انواع وسایل کمپینگ و کوهنوردی، ساک و قمقمه ورزشی و وسایل سفر اربعین و... در این بخش قرار می‌گیرند. همچنین شما می‌توانید وسایل مد نظر خود را بر اساس نوع ورزش (آبی، هوازی، بدنسازی و...) در دسته‌بندی‌های دیجی‌کالا پیدا کنید.
                            محصولات بومی و محلی
                            و در آخر دیجی‌کالا از طریق به فروش رساندن محصولات بومی و سنتی متفاوتی مثل انواع خوراکی، گلیم و گبه، ابزار و ... تلاش کرده تا بین هنر ایرانی و متقاضیان آن کوتاه‌ترین راه را پیدا کند. در این بخش شما می‌توانید انواع محصولات از جمله ظروف زیبای مخصوص به سفره هفت‌سین  و پذیرایی از مهمانان در روزهای نوروز، انواع آیینه و شمعدان و هر آن چیزی را که برای خلق زیبایی در روزهای بهاری به آن نیاز دارید، با قیمت مناسب و تنوع بسیار بالا انتخاب کنید. همچنین در صفحه برچسب ها، امکان مشاهده و خرید انواع محصولات با طرح های بومی وجود دارد.  دیجی‌کالا همچنین برای اینکه حال و هوای عید را به اعضای خود هدیه کند، تقویم ۱۴۰۱، انواع ایده عکس پروفایل عید نوروز، آهنگ‌های عید نوروز و موزیک‌های شاد بهاری، وسایل مربوط به خانه‌تکانیی و انواع لباس های عید  را برای شما فراهم کرده است تا بتوانید در کنار خرید خود، از این حال و هوای تازه نهایت لذت را ببرید.
                        </p>
                    </div>
                    <button 
                        className="show-more"
                        onClick={handleToggle}
                    >
                        {isExpanded ? 'نمایش کمتر' : 'نمایش بیشتر'}
                    </button>
                </div>
                <div className="sixth-etemad-sec">
                  <img src='../../../public/logo/kasbokar.webp' alt='kasbokar'></img>
                  <img src='../../../public/logo/rezi.webp' alt='kasbokar'></img>
                  <img src='../../../public/logo/aspra.webp' alt='kasbokar'></img>
                  <img src='../../../public/logo/kasbokar.webp' alt='kasbokar'></img>
                </div>
            </div>
            <div className="seventh-layer">
            برای استفاده از مطالب دیجی‌کالا، داشتن «هدف غیرتجاری» و ذکر «منبع» کافیست. تمام حقوق اين وب‌سايت نیز برای شرکت نوآوران فن آوازه (فروشگاه آنلاین دیجی‌کالا) است.
            </div>
            <div className="eighth-layer">
              <div className="first-row">
                <img src='../../../public/logo/diginext.svg' alt='diginext'></img>
                <img src='../../../public/logo/digimehr.svg' alt='digimehr'></img>
                <img src='../../../public/logo/diginext.svg' alt='diginext'></img>
                <img src='../../../public/logo/digiclub.svg' alt='digiclub'></img>
                <img src='../../../public/logo/digiplus.svg' alt='digiplus'></img>
                <img src='../../../public/logo/digistyle.svg' alt='digistyle'></img>
                <img src='../../../public/logo/digipay.svg' alt='digipay'></img>
                <img src='../../../public/logo/digimag.svg' alt='digimag'></img>
              </div>
              <div className="second-row">
                <img src='../../../public/logo/digikala-service.svg' alt='digikala-service'></img>
                <img src='../../../public/logo/digikala-business.svg' alt='digikala-business'></img>
                <img src='../../../public/logo/smartech.svg' alt='smartech'></img>
                <img src='../../../public/logo/digify.svg' alt='digify'></img>
                <img src='../../../public/logo/ganjeh.svg' alt='ganjeh'></img>
                <img src='../../../public/logo/digiexpress.svg' alt='digiexpress'></img>
              </div>
            </div>
        </footer>
    );
};

export default Footer; 